In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one -1.034854 -0.115462
1    a  two  0.760754 -0.223605
2    b  one  0.375688  0.004038
3    b  two  1.503255  0.136598
4    a  one  1.197093 -1.338405

In [2]:
df.groupby('key1')

In [3]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.034854 -0.115462
1    a  two  0.760754 -0.223605
4    a  one  1.197093 -1.338405
b
  key1 key2     data1     data2
2    b  one  0.375688  0.004038
3    b  two  1.503255  0.136598

In [4]:
for name,group in df.groupby(['key1','key2']):
    print(name)
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.034854 -0.115462
4    a  one  1.197093 -1.338405
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.760754 -0.223605
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.375688  0.004038
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.503255  0.136598

In [5]:
list(df.groupby('key1'))

[('a',
    key1 key2     data1     data2
  0    a  one -1.034854 -0.115462
  1    a  two  0.760754 -0.223605
  4    a  one  1.197093 -1.338405),
 ('b',
    key1 key2     data1     data2
  2    b  one  0.375688  0.004038
  3    b  two  1.503255  0.136598)]

In [6]:
dict(list(df.groupby('key1')))

{'a':   key1 key2     data1     data2
 0    a  one -1.034854 -0.115462
 1    a  two  0.760754 -0.223605
 4    a  one  1.197093 -1.338405,
 'b':   key1 key2     data1     data2
 2    b  one  0.375688  0.004038
 3    b  two  1.503255  0.136598}

In [7]:
#找出a

In [8]:
#找出a

In [9]:
#找出a
dict(list(df.groupby('key1')))['a']

  key1 key2     data1     data2
0    a  one -1.034854 -0.115462
1    a  two  0.760754 -0.223605
4    a  one  1.197093 -1.338405

In [10]:
dict(list(df.groupby('key1')))['b']

  key1 key2     data1     data2
2    b  one  0.375688  0.004038
3    b  two  1.503255  0.136598

In [11]:
dict(list(df.groupby(['key1','key2'])))

{('a',
  'one'):   key1 key2     data1     data2
 0    a  one -1.034854 -0.115462
 4    a  one  1.197093 -1.338405,
 ('a',
  'two'):   key1 key2     data1     data2
 1    a  two  0.760754 -0.223605,
 ('b',
  'one'):   key1 key2     data1     data2
 2    b  one  0.375688  0.004038,
 ('b',
  'two'):   key1 key2     data1     data2
 3    b  two  1.503255  0.136598}

In [12]:
dict(list(df.groupby(['key1','key2'])))[('a','one')]

  key1 key2     data1     data2
0    a  one -1.034854 -0.115462
4    a  one  1.197093 -1.338405

In [13]:
len(df.groupby(['key1','key2']))

4

In [14]:
len(df.groupby('key1'))

2

In [15]:
len(df.groupby('key2'))

2

In [16]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.468561  0.125629
1    a  two -1.561011 -0.233620
2    b  one -0.590073  0.589819
3    b  two -0.270312 -0.351645
4    a  one  0.777712 -0.927939

In [17]:
grouped = df.groupby('key1')
len(grouped)

2

In [18]:
dict(list(grouped))

{'a':   key1 key2     data1     data2
 0    a  one -0.468561  0.125629
 1    a  two -1.561011 -0.233620
 4    a  one  0.777712 -0.927939,
 'b':   key1 key2     data1     data2
 2    b  one -0.590073  0.589819
 3    b  two -0.270312 -0.351645}

In [19]:
grouped['data1'].mean()

key1
a   -0.417286
b   -0.430193
Name: data1, dtype: float64

In [20]:
grouped['data1'].agg(['mean','sum','max','min'])

          mean       sum       max       min
key1
a    -0.417286 -1.251859  0.777712 -1.561011
b    -0.430193 -0.860386 -0.270312 -0.590073